const request = require('request-promise-native');

const { moscowStationsList } = require('./moscowRawData');
const { saintPStationsList } = require('./saintpRawData');


// Missing data for moscow
let data = [
  "Китай-город (Калужско-Рижская линия)",
  "Китай-город (Таганско-Краснопресненская линия)",
  "Кутузовская (Московское центральное кольцо)",
  "Кунцевская (Арбатско-Покровская линия)",
  "Петровско-Разумовская (Люблинско-Дмитровская линия)",
  "Петровско-Разумовская (Серпуховско-Тимирязевская линия)",
  "Проспект Мира (Кольцевая линия)",
  "Проспект Мира (Калужско-Рижская линия)",
  "Таганская (Кольцевая линия)",
  "Таганская (Таганско-Краснопресненская линия)",
  "Каширская (Замоскворецкая кольцо)",
  "Каширская (Каховская линия)",
  "Бабушкинская",
  "Ботанический сад (Московское центральное кольцо)"
];



const resultData = {};

const errors = [];

const baseuri = 'https://maps.googleapis.com/maps/api/geocode/json?address=';

const formaturi = station => {
  const formatteduri = `${baseuri}${encodeURIComponent(`москва+метро+${station.split(' ').join('+')}`)}&key=AIzaSyAVZMeUsCJ7Rr9P_v4rpXii6eKdKB0iLn0`;
  //console.log('REQUEST TO:', formatteduri);
  return formatteduri;
};

const getCoords = station => request(formaturi(station));



  const run = async () => {
    const done = await Promise.all(data.map(async (st, index) => {
      try {
        const response = await getCoords(st);
        const res = JSON.parse(response);
        console.log(res.status);
        const latlong = {
          lat: res.results[0].geometry.location.lat,
          lng: res.results[0].geometry.location.lng
        };
        resultData[st] = latlong;
        data = data.filter(i => i !== st);
      } catch(e) {
        //console.log('ERROR', st,  e);
        errors.push(st);
      }
    }));
    console.log('----------------------------');
    console.log('RESULT DATA', JSON.stringify(resultData, void 0, 2));
    console.log('----------------------------');
    console.log('done');
    console.log('NOT FOUND OR OVER QUERY LIMIT', JSON.stringify(data, void 0, 2));
    console.log('ERRORS FOUND:');
    console.log(errors.length, errors);
  };
  run();




const moscowdata = {};


const saintpetersburgData = {
  "Пионерская": {
    "lat": 60.0030444,
    "lng": 30.297892
  },
  "Проспект Просвещения": {
    "lat": 60.0514636,
    "lng": 30.3324992
  },
  "Удельная": {
    "lat": 60.0177814,
    "lng": 30.3152373
  },
  "Академическая": {
    "lat": 60.01308849999999,
    "lng": 30.39776209999999
  },
  "Петроградская": {
    "lat": 59.96666200000001,
    "lng": 30.3114291
  },
  "Гражданский проспект": {
    "lat": 60.03566499999999,
    "lng": 30.420102
  },
  "Фрунзенская": {
    "lat": 59.90630160000001,
    "lng": 30.3176493
  },
  "Балтийская": {
    "lat": 59.9077095,
    "lng": 30.3001132
  },
  "Купчино": {
    "lat": 59.82971529999999,
    "lng": 30.3754302
  },
  "Комендантский проспект": {
    "lat": 60.00755629999999,
    "lng": 30.2577772
  },
  "Лиговский проспект": {
    "lat": 59.9208179,
    "lng": 30.3550178
  },
  "Чёрная речка": {
    "lat": 59.9854346,
    "lng": 30.3011467
  },
  "Девяткино": {
    "lat": 60.050189,
    "lng": 30.442632
  },
  "Политехническая": {
    "lat": 60.00846749999999,
    "lng": 30.3695865
  },
  "Приморская": {
    "lat": 59.9487539,
    "lng": 30.2322768
  },
  "Электросила": {
    "lat": 59.87919600000001,
    "lng": 30.3198625
  },
  "Площадь Мужества": {
    "lat": 60.000367,
    "lng": 30.3657389
  },
  "Парнас": {
    "lat": 60.06744320000001,
    "lng": 30.3344335
  },
  "Проспект Ветеранов": {
    "lat": 59.8429833,
    "lng": 30.2455527
  },
  "Озерки": {
    "lat": 60.0361015,
    "lng": 30.32144749999999
  },
  "Московская": {
    "lat": 59.9164566,
    "lng": 30.3185011
  },
  "Чернышевская": {
    "lat": 59.94421060000001,
    "lng": 30.3604775
  },
  "Площадь Ленина": {
    "lat": 59.9554418,
    "lng": 30.3568941
  },
  "Новочеркасская": {
    "lat": 59.9284366,
    "lng": 30.412012
  },
  "Ленинский проспект": {
    "lat": 59.850672,
    "lng": 30.268412
  },
  "Кировский завод": {
    "lat": 59.87982890000001,
    "lng": 30.2613274
  },
  "Адмиралтейская": {
    "lat": 59.93587170000001,
    "lng": 30.3149079
  },
  "Автово": {
    "lat": 59.86828200000001,
    "lng": 30.2569406
  },
  "Садовая": {
    "lat": 59.92685280000001,
    "lng": 30.3167434
  },
  "Невский проспект": {
    "lat": 59.9346721,
    "lng": 30.3306609
  },
  "Владимирская": {
    "lat": 59.9164566,
    "lng": 30.3185011
  },
  "Звенигородская": {
    "lat": 59.9223916,
    "lng": 30.335733
  },
  "Нарвская": {
    "lat": 59.90213519999999,
    "lng": 30.2748896
  },
  "Лесная": {
    "lat": 59.98036999999999,
    "lng": 30.350409
  },
  "Московские Ворота": {
    "lat": 59.8917547,
    "lng": 30.3181496
  },
  "Спасская": {
    "lat": 59.9265835,
    "lng": 30.318169
  },
  "Площадь Восстания": {
    "lat": 59.9315915,
    "lng": 30.3604422
  },
  "Елизаровская": {
    "lat": 59.896623,
    "lng": 30.423741
  },
  "Старая Деревня": {
    "lat": 59.98991849999999,
    "lng": 30.25608919999999
  },
  "Достоевская": {
    "lat": 59.92832800000001,
    "lng": 30.3462981
  },
  "Чкаловская": {
    "lat": 59.96103149999999,
    "lng": 30.292196
  },
  "Проспект Большевиков": {
    "lat": 59.91958399999999,
    "lng": 30.4694491
  },
  "Рыбацкое": {
    "lat": 59.83138699999999,
    "lng": 30.50141589999999
  },
  "Парк Победы": {
    "lat": 59.8658144,
    "lng": 30.320635
  },
  "Пушкинская": {
    "lat": 59.92057209999999,
    "lng": 30.3296797
  },
  "Улица Дыбенко": {
    "lat": 59.907294,
    "lng": 30.4833379
  },
  "Волковская": {
    "lat": 59.89838049999999,
    "lng": 30.3585654
  },
  "Площадь Александра Невского-1": {
    "lat": 59.9313227,
    "lng": 30.3547983
  },
  "Бухарестская": {
    "lat": 59.88376599999999,
    "lng": 30.369113
  },
  "Ладожская": {
    "lat": 59.93250099999999,
    "lng": 30.4392639
  },
  "Маяковская": {
    "lat": 59.93175549999999,
    "lng": 30.3547421
  },
  "Обводный канал": {
    "lat": 59.9145852,
    "lng": 30.3494145
  },
  "Пролетарская": {
    "lat": 59.864459,
    "lng": 30.470093
  },
  "Международная": {
    "lat": 59.87133600000001,
    "lng": 30.3800326
  },
  "Обухово": {
    "lat": 59.847901,
    "lng": 30.4554429
  },
  "Гостиный Двор": {
    "lat": 59.934251,
    "lng": 30.3352726
  },
  "Горьковская": {
    "lat": 59.956587,
    "lng": 30.318972
  },
  "Сенная площадь": {
    "lat": 59.9278357,
    "lng": 30.3201135
  },
  "Технологический институт-1": {
    "lat": 59.9162195,
    "lng": 30.3181914
  },
  "Технологический институт-2": {
    "lat": 59.9162195,
    "lng": 30.3181914
  },
  "Звёздная": {
    "lat": 59.8339299,
    "lng": 30.3474534
  },
  "Спортивная": {
    "lat": 59.95131740000001,
    "lng": 30.2941147
  },
  "Ломоносовская": {
    "lat": 59.87930299999999,
    "lng": 30.4469
  },
  "Площадь Александра Невского-2": {
    "lat": 59.9323308,
    "lng": 30.3484025
  },
  "Крестовский остров": {
    "lat": 59.9713982,
    "lng": 30.25912
  }
};

const moscowData = {
  "Кузнецкий Мост": {
    "lat": 55.7614779,
    "lng": 37.62434
  },
  "Спартак": {
    "lat": 55.818126,
    "lng": 37.435859
  },
  "Пролетарская": {
    "lat": 55.731371,
    "lng": 37.663937
  },
  "Полежаевская": {
    "lat": 55.777538,
    "lng": 37.51924899999999
  },
  "Баррикадная": {
    "lat": 55.7614128,
    "lng": 37.579258
  },
  "Текстильщики": {
    "lat": 55.7089716,
    "lng": 37.7334396
  },
  "Сходненская": {
    "lat": 55.8508825,
    "lng": 37.440025
  },
  "Тушинская": {
    "lat": 55.82710059999999,
    "lng": 37.4366454
  },
  "Пушкинская": {
    "lat": 55.7656289,
    "lng": 37.60418200000001
  },
  "Автозаводская (Замоскворецкая линия)": {
    "lat": 55.7084102,
    "lng": 37.6580913
  },
  "Волжская": {
    "lat": 55.6902876,
    "lng": 37.7553378
  },
  "Сретенский бульвар": {
    "lat": 55.7656364,
    "lng": 37.6375562
  },
  "Волгоградский проспект": {
    "lat": 55.7249352,
    "lng": 37.6870887
  },
  "Кузьминки": {
    "lat": 55.7054024,
    "lng": 37.7656694
  },
  "Планерная": {
    "lat": 55.86264079999999,
    "lng": 37.435708
  },
  "Щукинская": {
    "lat": 55.80835579999999,
    "lng": 37.464479
  },
  "Рязанский проспект": {
    "lat": 55.71665400000001,
    "lng": 37.792893
  },
  "Динамо": {
    "lat": 55.7891159,
    "lng": 37.5595953
  },
  "Беговая": {
    "lat": 55.7736361,
    "lng": 37.5439262
  },
  "Технопарк": {
    "lat": 55.693915,
    "lng": 37.664393
  },
  "Маяковская": {
    "lat": 55.7703912,
    "lng": 37.5960545
  },
  "Белорусская (Замоскворецкая линия)": {
    "lat": 55.77691300000001,
    "lng": 37.581465
  },
  "Выхино": {
    "lat": 55.71611799999999,
    "lng": 37.817089
  },
  "Октябрьское Поле": {
    "lat": 55.7940626,
    "lng": 37.4923524
  },
  "Пионерская": {
    "lat": 55.7361091,
    "lng": 37.467649
  },
  "Новокузнецкая": {
    "lat": 55.7422718,
    "lng": 37.6298175
  },
  "Электрозаводская": {
    "lat": 55.7727035,
    "lng": 37.6790474
  },
  "Жулебино": {
    "lat": 55.6842625,
    "lng": 37.8548295
  },
  "Фонвизинская": {
    "lat": 55.8219267,
    "lng": 37.5889479
  },
  "Комсомольская (Сокольническая линия)": {
    "lat": 55.7762511,
    "lng": 37.655818
  },
  "Кожуховская": {
    "lat": 55.7061396,
    "lng": 37.6864187
  },
  "Чкаловская": {
    "lat": 55.7561178,
    "lng": 37.6597442
  },
  "Комсомольская (Кольцевая линия)": {
    "lat": 55.7762511,
    "lng": 37.655818
  },
  "Улица 1905 года": {
    "lat": 55.7625902,
    "lng": 37.5641855
  },
  "Римская": {
    "lat": 55.7468006,
    "lng": 37.6795593
  },
  "Полянка": {
    "lat": 55.73683,
    "lng": 37.6186425
  },
  "Окружная": {
    "lat": 55.8490038,
    "lng": 37.5712362
  },
  "Борисово": {
    "lat": 55.632355,
    "lng": 37.7433734
  },
  "Печатники": {
    "lat": 55.69264760000001,
    "lng": 37.7281888
  },
  "Воробьёвы горы": {
    "lat": 55.7115933,
    "lng": 37.5610489
  },
  "Парк культуры (Кольцевая линия)": {
    "lat": 55.7355873,
    "lng": 37.5941313
  },
  "Марьино": {
    "lat": 55.649119,
    "lng": 37.7444829
  },
  "Авиамоторная": {
    "lat": 55.7510767,
    "lng": 37.7170718
  },
  "Парк культуры (Сокольническая линия)": {
    "lat": 55.7355873,
    "lng": 37.5941313
  },
  "Савёловская": {
    "lat": 55.79419799999999,
    "lng": 37.5888962
  },
  "Киевская (Филевская линия)": {
    "lat": 55.7437638,
    "lng": 37.567594
  },
  "Отрадное": {
    "lat": 55.863397,
    "lng": 37.6046189
  },
  "Лесопарковая": {
    "lat": 55.581433,
    "lng": 37.579106
  },
  "Смоленская": {
    "lat": 55.747933,
    "lng": 37.5836873
  },
  "Трубная": {
    "lat": 55.7678796,
    "lng": 37.6218172
  },
  "Перово": {
    "lat": 55.7509446,
    "lng": 37.7847251
  },
  "Курская (Арбатско-Покровская линия)": {
    "lat": 55.7521566,
    "lng": 37.6015557
  },
  "Бибирево": {
    "lat": 55.88346259999999,
    "lng": 37.6050213
  },
  "Локомотив": {
    "lat": 55.8032783,
    "lng": 37.7453285
  },
  "Ленинский проспект": {
    "lat": 55.70835169999999,
    "lng": 37.5873314
  },
  "Боровицкая": {
    "lat": 55.7505061,
    "lng": 37.6091447
  },
  "Варшавская": {
    "lat": 55.653663,
    "lng": 37.6208615
  },
  "Дубровка (Люблинско-Дмитровская линия)": {
    "lat": 55.7178531,
    "lng": 37.6767665
  },
  "Петровско-Разумовская (Люблинско-Дмитровская линия)": {
    "lat": 55.755826,
    "lng": 37.6172999
  },
  "Тёплый стан": {
    "lat": 55.6175142,
    "lng": 37.5087817
  },
  "Павелецкая (Кольцевая линия)": {
    "lat": 55.7297464,
    "lng": 37.6393494
  },
  "Октябрьская (Кольцевая линия)": {
    "lat": 55.73015059999999,
    "lng": 37.6121611
  },
  "Сухаревская": {
    "lat": 55.7723688,
    "lng": 37.6316918
  },
  "Крестьянская Застава": {
    "lat": 55.7323098,
    "lng": 37.6655398
  },
  "Румянцево": {
    "lat": 55.632969,
    "lng": 37.4416961
  },
  "Дубровка (Московское центральное кольцо)": {
    "lat": 55.7126661,
    "lng": 37.6776414
  },
  "Павелецкая (Замоскворецкая линия)": {
    "lat": 55.7297464,
    "lng": 37.6393494
  },
  "Волоколамская": {
    "lat": 55.835596,
    "lng": 37.382108
  },
  "Мякинино": {
    "lat": 55.82532399999999,
    "lng": 37.385172
  },
  "Чертановская": {
    "lat": 55.64083300000001,
    "lng": 37.606228
  },
  "Речной вокзал": {
    "lat": 55.8554462,
    "lng": 37.475747
  },
  "Рижская": {
    "lat": 55.792496,
    "lng": 37.6361511
  },
  "Дмитровская": {
    "lat": 55.81119409999999,
    "lng": 37.5752538
  },
  "Нижегородская": {
    "lat": 55.732132,
    "lng": 37.7282261
  },
  "Стрешнево": {
    "lat": 55.8136163,
    "lng": 37.4867959
  },
  "Чистые пруды": {
    "lat": 55.7648374,
    "lng": 37.6378526
  },
  "Крымская": {
    "lat": 55.689854,
    "lng": 37.6057769
  },
  "Ботанический сад (Калужско-Рижская линия)": {
    "lat": 55.845341,
    "lng": 37.63870989999999
  },
  "Марксистская": {
    "lat": 55.74069720000001,
    "lng": 37.6571604
  },
  "Театральная": {
    "lat": 55.7565697,
    "lng": 37.619604
  },
  "Шелепиха": {
    "lat": 55.7575685,
    "lng": 37.5255417
  }
};



// Select all stations from HTML web page

/*let data = {};

$("g[id^='s']").each((i, v) => {
  const name = $(v).attr('metro-station-name');
  data[name] = {};
});*/
