var stations = {
  "Международная": {
    "lat": 55.7478101,
    "lng": 37.5331569
  },
  "Выставочная": {
    "lat": 55.750015,
    "lng": 37.542048
  },
  "Пионерская": {
    "lat": 55.7361091,
    "lng": 37.467649
  },
  "Улица Горчакова": {
    "lat": 55.5421542,
    "lng": 37.5328515
  },
  "Молодёжная": {
    "lat": 55.7408078,
    "lng": 37.4152942
  },
  "Студенческая": {
    "lat": 55.7387995,
    "lng": 37.5483774
  },
  "Багратионовская": {
    "lat": 55.7431254,
    "lng": 37.4983262
  },
  "Кунцевская (Филевская линия)": {
    "lat": 55.7521566,
    "lng": 37.6015557
  },
  "Славянский бульвар": {
    "lat": 55.729602,
    "lng": 37.470814
  },
  "Митино": {
    "lat": 55.86315190000001,
    "lng": 37.3630213
  },
  "Пятницкое шоссе": {
    "lat": 55.85587599999999,
    "lng": 37.35418110000001
  },
  "Строгино": {
    "lat": 55.8017632,
    "lng": 37.4079916
  },
  "Электрозаводская": {
    "lat": 55.7824092,
    "lng": 37.7066572
  },
  "Марксистская": {
    "lat": 55.74069720000001,
    "lng": 37.6571604
  },
  "Перово": {
    "lat": 55.7509446,
    "lng": 37.7847251
  },
  "Люблино": {
    "lat": 55.675739,
    "lng": 37.7617911
  },
  "Курская (Кольцевая линия)": {
    "lat": 55.7584345,
    "lng": 37.6604195
  },
  "Савёловская": {
    "lat": 55.79419799999999,
    "lng": 37.5888962
  },
  "Бульвар Рокоссовского (Сокольническая линия)": {
    "lat": 55.813927,
    "lng": 37.7338677
  },
  "Баррикадная": {
    "lat": 55.7614128,
    "lng": 37.579258
  },
  "Рязанский проспект": {
    "lat": 55.71665400000001,
    "lng": 37.792893
  },
  "Улица Старокачаловская": {
    "lat": 55.56913400000001,
    "lng": 37.576364
  },
  "Речной вокзал": {
    "lat": 55.8554462,
    "lng": 37.475747
  },
  "Водный стадион": {
    "lat": 55.8390354,
    "lng": 37.4874271
  },
  "Крылатское": {
    "lat": 55.7557968,
    "lng": 37.4087696
  },
  "Жулебино": {
    "lat": 55.6842625,
    "lng": 37.8548295
  },
  "Парк Победы (Арбатско-Покровская линия)": {
    "lat": 55.73588480000001,
    "lng": 37.5174924
  },
  "Маяковская": {
    "lat": 55.7703912,
    "lng": 37.5960545
  },
  "Автозаводская (Замоскворецкая линия)": {
    "lat": 55.7084102,
    "lng": 37.6580913
  },
  "Красногвардейская": {
    "lat": 55.6140855,
    "lng": 37.7443026
  },
  "Кутузовская (Филевская линия)": {
    "lat": 55.74092719999999,
    "lng": 37.537459
  },
  "Алма-Атинская": {
    "lat": 55.632813,
    "lng": 37.766061
  },
  "Коломенская": {
    "lat": 55.67943829999999,
    "lng": 37.6633544
  },
  "Кантемировская": {
    "lat": 55.6363604,
    "lng": 37.65608659999999
  },
  "Тверская": {
    "lat": 55.76534849999999,
    "lng": 37.6049831
  },
  "Бунинская аллея": {
    "lat": 55.5376691,
    "lng": 37.5140834
  },
  "Белорусская (Замоскворецкая линия)": {
    "lat": 55.77702189999999,
    "lng": 37.5814844
  },
  "Арбатская": {
    "lat": 55.7521566,
    "lng": 37.6015557
  },
  "Чистые пруды": {
    "lat": 55.7648374,
    "lng": 37.6378526
  },
  "Стрешнево": {
    "lat": 55.8136163,
    "lng": 37.4867959
  },
  "Киевская (Арбатско-Покровская линия)": {
    "lat": 55.7521566,
    "lng": 37.6015557
  },
  "Киевская (Кольцевая линия)": {
    "lat": 55.7437638,
    "lng": 37.567594
  },
  "Лубянка": {
    "lat": 55.75926339999999,
    "lng": 37.6281477
  },
  "Сходненская": {
    "lat": 55.8508825,
    "lng": 37.440025
  },
  "Волоколамская": {
    "lat": 55.835596,
    "lng": 37.382108
  },
  "Пушкинская": {
    "lat": 55.7656289,
    "lng": 37.60418200000001
  },
  "Полежаевская": {
    "lat": 55.777538,
    "lng": 37.51924899999999
  },
  "Мякинино": {
    "lat": 55.82532399999999,
    "lng": 37.385172
  },
  "Щукинская": {
    "lat": 55.80835579999999,
    "lng": 37.464479
  },
  "Беговая": {
    "lat": 55.7736361,
    "lng": 37.5439262
  },
  "Октябрьское Поле": {
    "lat": 55.7940626,
    "lng": 37.4923524
  },
  "Бутырская": {
    "lat": 55.8141702,
    "lng": 37.6008714
  },
  "Первомайская": {
    "lat": 55.7937818,
    "lng": 37.7993487
  },
  "Бауманская": {
    "lat": 55.7725599,
    "lng": 37.6784801
  },
  "Медведково": {
    "lat": 55.88713,
    "lng": 37.66155639999999
  },
  "Краснопресненская": {
    "lat": 55.76024659999999,
    "lng": 37.5771212
  },
  "Боровицкая": {
    "lat": 55.7505061,
    "lng": 37.6091447
  },
  "Партизанская": {
    "lat": 55.786732,
    "lng": 37.751268
  },
  "Нагорная": {
    "lat": 55.6724444,
    "lng": 37.6101503
  },
  "Павелецкая (Кольцевая линия)": {
    "lat": 55.7310093,
    "lng": 37.6363571
  },
  "Кожуховская": {
    "lat": 55.7061396,
    "lng": 37.6864187
  },
  "Каховская": {
    "lat": 55.6525055,
    "lng": 37.5969296
  },
  "Чеховская": {
    "lat": 55.7662635,
    "lng": 37.609487
  },
  "Комсомольская (Сокольническая линия)": {
    "lat": 55.7762511,
    "lng": 37.655818
  },
  "ЗИЛ": {
    "lat": 55.69800069999999,
    "lng": 37.64770499999999
  },
  "Бульвар Рокоссовского (Московское центральное кольцо)": {
    "lat": 55.813927,
    "lng": 37.7338677
  },
  "Парк культуры (Кольцевая линия)": {
    "lat": 55.7355873,
    "lng": 37.5941313
  },
  "Андроновка": {
    "lat": 55.7467091,
    "lng": 37.73726
  },
  "Профсоюзная": {
    "lat": 55.6790694,
    "lng": 37.5631664
  },
  "Севастопольская": {
    "lat": 55.6510645,
    "lng": 37.5982665
  },
  "Парк Победы (Калининская линия)": {
    "lat": 55.73588480000001,
    "lng": 37.5174924
  },
  "Бибирево": {
    "lat": 55.88346259999999,
    "lng": 37.6050213
  },
  "Сретенский бульвар": {
    "lat": 55.7656364,
    "lng": 37.6375562
  },
  "Панфиловская": {
    "lat": 55.7974039,
    "lng": 37.4985915
  },
  "Битцевский парк": {
    "lat": 55.6008479,
    "lng": 37.555743
  },
  "Окружная": {
    "lat": 55.8490038,
    "lng": 37.5712362
  },
  "Пл. Революции": {
    "lat": 55.7564497,
    "lng": 37.623354
  },
  "Новокосино": {
    "lat": 55.745106,
    "lng": 37.86401499999999
  },
  "Беляево": {
    "lat": 55.6435702,
    "lng": 37.52728219999999
  },
  "Менделеевская": {
    "lat": 55.7819839,
    "lng": 37.59860219999999
  },
  "Щёлковская": {
    "lat": 55.8106,
    "lng": 37.7980196
  },
  "Кропоткинская": {
    "lat": 55.744263,
    "lng": 37.6004452
  },
  "Курская (Арбатско-Покровская линия)": {
    "lat": 55.7521566,
    "lng": 37.6015557
  },
  "Цветной бульвар": {
    "lat": 55.7712005,
    "lng": 37.62162070000001
  },
  "Октябрьская (Кольцевая линия)": {
    "lat": 55.73015059999999,
    "lng": 37.6121611
  },
  "Дмитровская": {
    "lat": 55.81119409999999,
    "lng": 37.5752538
  },
  "Владыкино (Московское центральное кольцо)": {
    "lat": 55.8460423,
    "lng": 37.5893196
  },
  "Новослободская": {
    "lat": 55.7800593,
    "lng": 37.6019928
  },
  "Юго-Западная": {
    "lat": 55.664465,
    "lng": 37.4843114
  },
  "Добрынинская": {
    "lat": 55.7288168,
    "lng": 37.6239476
  },
  "Тульская": {
    "lat": 55.709227,
    "lng": 37.6247149
  },
  "Кузнецкий Мост": {
    "lat": 55.7614779,
    "lng": 37.62434
  },
  "Октябрьская (Калужско-Рижская линия)": {
    "lat": 55.73015059999999,
    "lng": 37.6121611
  },
  "Киевская (Филевская линия)": {
    "lat": 55.7437638,
    "lng": 37.567594
  },
  "Планерная": {
    "lat": 55.86264079999999,
    "lng": 37.435708
  },
  "Парк культуры (Сокольническая линия)": {
    "lat": 55.7355873,
    "lng": 37.5941313
  },
  "Трубная": {
    "lat": 55.7678796,
    "lng": 37.6218172
  },
  "Полянка": {
    "lat": 55.73683,
    "lng": 37.6186425
  },
  "Владыкино (Серпухово-Тимирязевская линия)": {
    "lat": 55.8488462,
    "lng": 37.5908953
  },
  "Балтийская": {
    "lat": 55.8258959,
    "lng": 37.496436
  },
  "Павелецкая (Замоскворецкая линия)": {
    "lat": 55.7310093,
    "lng": 37.6363571
  },
  "Красносельская": {
    "lat": 55.7794012,
    "lng": 37.6659152
  },
  "Марьина Роща": {
    "lat": 55.79409510000001,
    "lng": 37.6162673
  },
  "Тропарёво": {
    "lat": 55.645736,
    "lng": 37.47267009999999
  },
  "Университет": {
    "lat": 55.692711,
    "lng": 37.536845
  },
  "Улица 1905 года": {
    "lat": 55.76332379999999,
    "lng": 37.5596383
  },
  "Ленинский проспект": {
    "lat": 55.70835169999999,
    "lng": 37.5873314
  },
  "Лужники": {
    "lat": 55.7209224,
    "lng": 37.5600403
  },
  "Верхние Котлы": {
    "lat": 55.6897057,
    "lng": 37.6187646
  },
  "Угрешская": {
    "lat": 55.7158372,
    "lng": 37.6948812
  },
  "Варшавская": {
    "lat": 55.653663,
    "lng": 37.6208615
  },
  "Тёплый стан": {
    "lat": 55.61854570000001,
    "lng": 37.5075941
  },
  "Отрадное": {
    "lat": 55.8627984,
    "lng": 37.60459
  },
  "Пл. Гагарина": {
    "lat": 55.7070613,
    "lng": 37.5859774
  },
  "Ростокино": {
    "lat": 55.842933,
    "lng": 37.665358
  },
  "Белорусская (Кольцевая линия)": {
    "lat": 55.77702189999999,
    "lng": 37.5814844
  },
  "Борисово": {
    "lat": 55.632355,
    "lng": 37.7433734
  },
  "Лермонтовский проспект": {
    "lat": 55.7021495,
    "lng": 37.8517845
  },
  "Александровский сад": {
    "lat": 55.7521222,
    "lng": 37.6136934
  },
  "Нахимовский проспект": {
    "lat": 55.6641819,
    "lng": 37.6066915
  },
  "Фили": {
    "lat": 55.7431254,
    "lng": 37.4983262
  },
  "Кузьминки": {
    "lat": 55.705137,
    "lng": 37.7669158
  },
  "Выхино": {
    "lat": 55.71611799999999,
    "lng": 37.817089
  },
  "Шипиловская": {
    "lat": 55.6202081,
    "lng": 37.7432181
  },
  "Аэропорт": {
    "lat": 55.8010929,
    "lng": 37.5322523
  },
  "Котельники": {
    "lat": 55.67470179999999,
    "lng": 37.8581787
  },
  "Динамо": {
    "lat": 55.7891159,
    "lng": 37.5595953
  },
  "Волжская": {
    "lat": 55.6902876,
    "lng": 37.7553378
  },
  "Третьяковская (Калужско-Рижская линия)": {
    "lat": 55.796722,
    "lng": 37.639819
  },
  "Фонвизинская": {
    "lat": 55.8219267,
    "lng": 37.5889479
  },
  "Авиамоторная": {
    "lat": 55.7510767,
    "lng": 37.7170718
  },
  "Сухаревская": {
    "lat": 55.7723688,
    "lng": 37.6316918
  },
  "Аннино": {
    "lat": 55.5827441,
    "lng": 37.5965773
  },
  "Шаболовская": {
    "lat": 55.718294,
    "lng": 37.609102
  },
  "Локомотив": {
    "lat": 55.8032783,
    "lng": 37.7453285
  },
  "Комсомольская (Кольцевая линия)": {
    "lat": 55.7762511,
    "lng": 37.655818
  },
  "Братиславская": {
    "lat": 55.6588442,
    "lng": 37.7500922
  },
  "Саларьево": {
    "lat": 55.62196770000001,
    "lng": 37.424656
  },
  "Бульвар Адмирала Ушакова": {
    "lat": 55.54516899999999,
    "lng": 37.5426761
  },
  "ВДНХ": {
    "lat": 55.831,
    "lng": 37.62979989999999
  },
  "Площадь Ильича": {
    "lat": 55.747211,
    "lng": 37.6799306
  },
  "Шоссе Энтузиастов (Московское центральное кольцо)": {
    "lat": 55.75840789999999,
    "lng": 37.7516629
  },
  "Раменки": {
    "lat": 55.7056774,
    "lng": 37.5150243
  },
  "Серпуховская": {
    "lat": 55.72721,
    "lng": 37.6252376
  },
  "Южная": {
    "lat": 55.6233905,
    "lng": 37.60913
  },
  "Новогиреево": {
    "lat": 55.751409,
    "lng": 37.81846300000001
  },
  "Дубровка (Люблинско-Дмитровская линия)": {
    "lat": 55.7126661,
    "lng": 37.6776414
  },
  "Нагатинская": {
    "lat": 55.6843162,
    "lng": 37.6234749
  },
  "Рижская": {
    "lat": 55.792496,
    "lng": 37.6361511
  },
  "Орехово": {
    "lat": 55.613381,
    "lng": 37.6945319
  },
  "Семёновская": {
    "lat": 55.782747,
    "lng": 37.7226933
  },
  "Зябликово": {
    "lat": 55.6105935,
    "lng": 37.7461215
  },
  "Ломоносовский проспект": {
    "lat": 55.707397,
    "lng": 37.516707
  },
  "Печатники": {
    "lat": 55.69264760000001,
    "lng": 37.7281888
  },
  "Тушинская": {
    "lat": 55.82710059999999,
    "lng": 37.4366454
  },
  "Ботанический сад (Калужско-Рижская линия)": {
    "lat": 55.845341,
    "lng": 37.63870989999999
  },
  "Красные Ворота": {
    "lat": 55.7694185,
    "lng": 37.6492375
  },
  "Текстильщики": {
    "lat": 55.7089716,
    "lng": 37.7334396
  },
  "Чертановская": {
    "lat": 55.64083300000001,
    "lng": 37.606228
  },
  "Алексеевская": {
    "lat": 55.80820259999999,
    "lng": 37.6370504
  },
  "Алтуфьево": {
    "lat": 55.89863330000001,
    "lng": 37.5850668
  },
  "Соколиная Гора": {
    "lat": 55.771528,
    "lng": 37.7451019
  },
  "Волгоградский проспект": {
    "lat": 55.7249352,
    "lng": 37.6870887
  },
  "Охотный ряд": {
    "lat": 55.7571346,
    "lng": 37.6147071
  },
  "Марьино": {
    "lat": 55.649119,
    "lng": 37.7444829
  },
  "Ул. Академика Янгеля": {
    "lat": 55.59499599999999,
    "lng": 37.6017376
  },
  "Пролетарская": {
    "lat": 55.731371,
    "lng": 37.663937
  },
  "Достоевская": {
    "lat": 55.7816464,
    "lng": 37.6140785
  },
  "Римская": {
    "lat": 55.7468006,
    "lng": 37.6795593
  },
  "Чкаловская": {
    "lat": 55.7561178,
    "lng": 37.6597442
  },
  "Третьяковская (Калининская линия)": {
    "lat": 55.7404455,
    "lng": 37.6297724
  },
  "Черкизовская": {
    "lat": 55.8032783,
    "lng": 37.7453285
  },
  "Фрунзенская": {
    "lat": 55.726897,
    "lng": 37.578633
  },
  "Тимирязевская": {
    "lat": 55.819157,
    "lng": 37.576042
  },
  "Хорошёво": {
    "lat": 55.777364,
    "lng": 37.5071288
  },
  "Свиблово": {
    "lat": 55.85574390000001,
    "lng": 37.6544252
  },
  "Библиотека им. Ленина": {
    "lat": 55.7522463,
    "lng": 37.6102571
  },
  "Улица Скобелевская": {
    "lat": 55.548023,
    "lng": 37.554657
  },
  "Деловой центр (МЦК)": {
    "lat": 55.7472358,
    "lng": 37.53213969999999
  },
  "Нижегородская": {
    "lat": 55.732132,
    "lng": 37.7282261
  },
  "Войковская": {
    "lat": 55.818848,
    "lng": 37.4987659
  },
  "Новые Черёмушки": {
    "lat": 55.670385,
    "lng": 37.554719
  },
  "Бульвар Дмитрия Донского": {
    "lat": 55.569497,
    "lng": 37.576439
  },
  "Лихоборы": {
    "lat": 55.8476559,
    "lng": 37.5530459
  },
  "Пражская": {
    "lat": 55.610969,
    "lng": 37.6038005
  },
  "Измайлово": {
    "lat": 55.7894995,
    "lng": 37.7429937
  },
  "Минская": {
    "lat": 55.72458200000001,
    "lng": 37.496939
  },
  "Деловой центр": {
    "lat": 55.74906499999999,
    "lng": 37.539564
  },
  "Сокольники": {
    "lat": 55.7897614,
    "lng": 37.6809504
  },
  "Дубровка (Московское центральное кольцо)": {
    "lat": 55.7126661,
    "lng": 37.6776414
  },
  "Новоясеневская": {
    "lat": 55.6019545,
    "lng": 37.5529046
  },
  "Спартак": {
    "lat": 55.818126,
    "lng": 37.435859
  },
  "Измайловская": {
    "lat": 55.78840839999999,
    "lng": 37.778897
  },
  "Новокузнецкая": {
    "lat": 55.7422718,
    "lng": 37.6298175
  },
  "Домодедовская": {
    "lat": 55.6100587,
    "lng": 37.7184665
  },
  "Смоленская": {
    "lat": 55.747933,
    "lng": 37.5836873
  },
  "Проспект Вернадского": {
    "lat": 55.67684999999999,
    "lng": 37.506491
  },
  "Технопарк": {
    "lat": 55.693915,
    "lng": 37.664393
  },
  "Театральная": {
    "lat": 55.7565697,
    "lng": 37.619604
  },
  "Сокол": {
    "lat": 55.8050392,
    "lng": 37.514829
  },
  "Шелепиха": {
    "lat": 55.7575685,
    "lng": 37.5255417
  },
  "Царицыно": {
    "lat": 55.6216433,
    "lng": 37.6693266
  },
  "Лесопарковая": {
    "lat": 55.581433,
    "lng": 37.579106
  },
  "Крестьянская Застава": {
    "lat": 55.7323098,
    "lng": 37.6655398
  },
  "Румянцево": {
    "lat": 55.632969,
    "lng": 37.4416961
  },
  "Зорге": {
    "lat": 55.78819919999999,
    "lng": 37.5042661
  },
  "Белокаменная": {
    "lat": 55.8293,
    "lng": 37.702428
  },
  "Филёвский парк": {
    "lat": 55.7404467,
    "lng": 37.4824586
  },
  "Новохохловская": {
    "lat": 55.724146,
    "lng": 37.716998
  },
  "Автозаводская (Московское центральное кольцо)": {
    "lat": 55.7084102,
    "lng": 37.6580913
  },
  "Крымская": {
    "lat": 55.689854,
    "lng": 37.6057769
  },
  "Тургеневская": {
    "lat": 55.7654854,
    "lng": 37.63659060000001
  },
  "Преображенская пл.": {
    "lat": 55.7958578,
    "lng": 37.7130647
  },
  "Шоссе Энтузиастов (Калининская линия)": {
    "lat": 55.75840789999999,
    "lng": 37.7516629
  },
  "Калужская": {
    "lat": 55.65716699999999,
    "lng": 37.540428
  },
  "Воробьёвы горы": {
    "lat": 55.7115933,
    "lng": 37.5610489
  },
  "Коптево": {
    "lat": 55.8267016,
    "lng": 37.5172851
  },
  "Ясенево": {
    "lat": 55.6061826,
    "lng": 37.5348709
  },
  "Академическая": {
    "lat": 55.7271276,
    "lng": 37.611066
  },
  "Спортивная": {
    "lat": 55.7224041,
    "lng": 37.5619474
  },
  "Коньково": {
    "lat": 55.6346554,
    "lng": 37.51959009999999
  }
};
