var stations = {
  "Озерки": {
    "lat": 60.0361015,
    "lng": 30.32144749999999
  },
  "Пионерская": {
    "lat": 60.0030444,
    "lng": 30.297892
  },
  "Удельная": {
    "lat": 60.0177814,
    "lng": 30.3152373
  },
  "Площадь Восстания": {
    "lat": 59.9315915,
    "lng": 30.3604422
  },
  "Комендантский проспект": {
    "lat": 60.00755629999999,
    "lng": 30.2577772
  },
  "Площадь Ленина": {
    "lat": 59.9554418,
    "lng": 30.3568941
  },
  "Спортивная": {
    "lat": 59.95131740000001,
    "lng": 30.2941147
  },
  "Садовая": {
    "lat": 59.92685280000001,
    "lng": 30.3167434
  },
  "Чернышевская": {
    "lat": 59.94421060000001,
    "lng": 30.3604775
  },
  "Горьковская": {
    "lat": 59.956587,
    "lng": 30.318972
  },
  "Крестовский остров": {
    "lat": 59.9713982,
    "lng": 30.25912
  },
  "Площадь Мужества": {
    "lat": 60.000367,
    "lng": 30.3657389
  },
  "Проспект Ветеранов": {
    "lat": 59.8429833,
    "lng": 30.2455527
  },
  "Сенная площадь": {
    "lat": 59.9278357,
    "lng": 30.3201135
  },
  "Достоевская": {
    "lat": 59.92832800000001,
    "lng": 30.3462981
  },
  "Пушкинская": {
    "lat": 59.92057209999999,
    "lng": 30.3296797
  },
  "Международная": {
    "lat": 59.87133600000001,
    "lng": 30.3800326
  },
  "Парнас": {
    "lat": 60.06744320000001,
    "lng": 30.3344335
  },
  "Петроградская": {
    "lat": 59.96666200000001,
    "lng": 30.3114291
  },
  "Московские Ворота": {
    "lat": 59.8917547,
    "lng": 30.3181496
  },
  "Чкаловская": {
    "lat": 59.96103149999999,
    "lng": 30.292196
  },
  "Спасская": {
    "lat": 59.9265835,
    "lng": 30.318169
  },
  "Парк Победы": {
    "lat": 59.8658144,
    "lng": 30.320635
  },
  "Лиговский проспект": {
    "lat": 59.9208179,
    "lng": 30.3550178
  },
  "Лесная": {
    "lat": 59.98036999999999,
    "lng": 30.350409
  },
  "Московская": {
    "lat": 59.9164566,
    "lng": 30.3185011
  },
  "Купчино": {
    "lat": 59.82971529999999,
    "lng": 30.3754302
  },
  "Площадь Александра Невского-1": {
    "lat": 59.9313227,
    "lng": 30.3547983
  },
  "Старая Деревня": {
    "lat": 59.98991849999999,
    "lng": 30.25608919999999
  },
  "Невский проспект": {
    "lat": 59.9346721,
    "lng": 30.3306609
  },
  "Технологический институт-2": {
    "lat": 59.9162195,
    "lng": 30.3181914
  },
  "Владимирская": {
    "lat": 59.9164566,
    "lng": 30.3185011
  },
  "Звёздная": {
    "lat": 59.8339299,
    "lng": 30.3474534
  },
  "Гостиный Двор": {
    "lat": 59.934251,
    "lng": 30.3352726
  },
  "Гражданский проспект": {
    "lat": 60.03566499999999,
    "lng": 30.420102
  },
  "Чёрная речка": {
    "lat": 59.9854346,
    "lng": 30.3011467
  },
  "Адмиралтейская": {
    "lat": 59.93587170000001,
    "lng": 30.3149079
  },
  "Электросила": {
    "lat": 59.87919600000001,
    "lng": 30.3198625
  },
  "Обводный канал": {
    "lat": 59.9145852,
    "lng": 30.3494145
  },
  "Проспект Просвещения": {
    "lat": 60.0514636,
    "lng": 30.3324992
  },
  "Площадь Александра Невского-2": {
    "lat": 59.9323308,
    "lng": 30.3484025
  },
  "Нарвская": {
    "lat": 59.90213519999999,
    "lng": 30.2748896
  },
  "Балтийская": {
    "lat": 59.9077095,
    "lng": 30.3001132
  },
  "Кировский завод": {
    "lat": 59.87982890000001,
    "lng": 30.2613274
  },
  "Елизаровская": {
    "lat": 59.896623,
    "lng": 30.423741
  },
  "Политехническая": {
    "lat": 60.00846749999999,
    "lng": 30.3695865
  },
  "Пролетарская": {
    "lat": 59.864459,
    "lng": 30.470093
  },
  "Ладожская": {
    "lat": 59.93250099999999,
    "lng": 30.4392639
  },
  "Ленинский проспект": {
    "lat": 59.850672,
    "lng": 30.268412
  },
  "Девяткино": {
    "lat": 60.050189,
    "lng": 30.442632
  },
  "Маяковская": {
    "lat": 59.93175549999999,
    "lng": 30.3547421
  },
  "Обухово": {
    "lat": 59.847901,
    "lng": 30.4554429
  },
  "Академическая": {
    "lat": 60.01308849999999,
    "lng": 30.39776209999999
  },
  "Фрунзенская": {
    "lat": 59.90630160000001,
    "lng": 30.3176493
  },
  "Ломоносовская": {
    "lat": 59.87930299999999,
    "lng": 30.4469
  },
  "Рыбацкое": {
    "lat": 59.83138699999999,
    "lng": 30.50141589999999
  },
  "Технологический институт-1": {
    "lat": 59.9162195,
    "lng": 30.3181914
  },
  "Волковская": {
    "lat": 59.89838049999999,
    "lng": 30.3585654
  },
  "Звенигородская": {
    "lat": 59.9223916,
    "lng": 30.335733
  },
  "Приморская": {
    "lat": 59.9487539,
    "lng": 30.2322768
  },
  "Бухарестская": {
    "lat": 59.88376599999999,
    "lng": 30.369113
  },
  "Улица Дыбенко": {
    "lat": 59.907294,
    "lng": 30.4833379
  },
  "Проспект Большевиков": {
    "lat": 59.91958399999999,
    "lng": 30.4694491
  },
  "Новочеркасская": {
    "lat": 59.9284366,
    "lng": 30.412012
  },
  "Автово": {
    "lat": 59.86828200000001,
    "lng": 30.2569406
  }
};
